gxdsl/stm32103c8t6/5_5 IC测周法测频率/Hardware/IC.c
#include "stm32f10x.h"                  // Device header

void IC_Init()
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM3,ENABLE);
	
	GPIO_InitTypeDef GPIO_InitStructure;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_6;	
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA,&GPIO_InitStructure);
	
	TIM_InternalClockConfig(TIM3);
	
	TIM_ICInitTypeDef IC_InitStructure;
	IC_InitStructure.TIM_Channel = TIM_Channel_1;
	IC_InitStructure.TIM_ICFilter = 0xF;
	IC_InitStructure.TIM_ICPolarity = TIM_ICPolarity_Rising;	//上升沿触发
	IC_InitStructure.TIM_ICPrescaler = TIM_ICPSC_DIV1;
	IC_InitStructure.TIM_ICSelection = TIM_ICSelection_DirectTI;
	TIM_ICInit(TIM3,&IC_InitStructure);
	
	TIM_TimeBaseInitTypeDef TimBase_Initstructure;
	TimBase_Initstructure.TIM_ClockDivision = TIM_CKD_DIV1;
	TimBase_Initstructure.TIM_CounterMode = TIM_CounterMode_Up;
	TimBase_Initstructure.TIM_Period = 65536 - 1;	 //ARR
	TimBase_Initstructure.TIM_Prescaler = 72 - 1;	//PSC
	TimBase_Initstructure.TIM_RepetitionCounter = 0;
	TIM_TimeBaseInit(TIM3,&TimBase_Initstructure);
	
	TIM_SelectInputTrigger(TIM3, TIM_TS_TI1FP1);
	TIM_SelectSlaveMode(TIM3, TIM_SlaveMode_Reset);
	
	TIM_Cmd(TIM3,ENABLE);
}

uint32_t IC_GetFreq(void)
{
	return 1000000/TIM_GetCapture1(TIM3);
}
